---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
JoinGeometryUtils Methods
JoinGeometryUtils Class See Also Send Feedback
---

The JoinGeometryUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | AreElementsJoined | Determines whether two elements are joined. |
|  | GetJoinedElements | Returns all elements joined to given element. |
|  | IsCuttingElementInJoin | Determines whether the first of two joined elements is cutting the second element. |
|  | JoinGeometry | Creates clean joins between two elements that share a common face. |
|  | SwitchJoinOrder | Reverses the order in which two elements are joined. |
|  | UnjoinGeometry | Removes a join between two elements. |

# See Also

JoinGeometryUtils Class

Autodesk.Revit.DB Namespace